# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

numbers=[2, 3, 4, 5, 6]
multipl=[]

for i in range(int(len(numbers)/2+0.5)):
    multipl.append(numbers[i]*numbers[-(i+1)])

print(multipl)
